app/views/books/_form.html.erb

SELECT "books".* FROM "books" WHERE ("books".user_id = 1)
SELECT "categories".* FROM "categories" WHERE "categories"."name" = 'system:current income' LIMIT 1
---
  <div class="field">
    <%= collection_select(:book, :category_id, Category.all, :id, :name) %>