app/controllers/books_controller.rb

SELECT "books".* FROM "books" WHERE (user_id = 2 AND id not in (NULL))
SELECT COUNT(*) FROM "books" WHERE (user_id = 5 AND category_id in (3,4,5,6,7,8) AND created_at >= ('2011-05-03 00:00:00.000000') AND created_at <= ('2011-05-03 23:59:59.999999'))
---
  def index
    @books = Book.read_all_except_system(current_user.id).page(params[:page]).per(10)

INSERT INTO "books" ("amount", "category", "description", "user_id", "created_at", "updated_at", "id") VALUES (1000.0, 'pay', 'paycheck for this month', NULL, '2011-03-31 04:05:14.199922', '2011-03-31 04:05:14.199922', 1)
---
  def create
    @book = Book.new(params[:book])
    @book.user_id = current_user.id

    # figure out if the item entered if a bill or income.
    # if its a bill. change the value so its neatige.
    if @book.category.prefix_is_income?
      Book.add_current_income(current_user.id, @book.amount)
    else
      Book.add_current_bill(current_user.id, @book.amount)
    end

    # updates the running total.
    # @book.update_current_income
    # above line is still in testing.

    respond_to do |format|
      if @book.save

SELECT "books".* FROM "books" WHERE "books"."id" = 7 LIMIT 1
UPDATE "books" SET "amount" = 970.0, "description" = '', "updated_at" = '2011-04-07 02:11:15.137189' WHERE "books"."id" = 1
---
  def update
    @book = Book.find(params[:id])

    # figure out if the item entered if a bill or income.
    # if its a bill. change the value so its neatige.
    if @book.category.prefix_is_income?
      Book.update_current_income(current_user.id, @book.amount, params[:book][:amount])

SELECT "books".* FROM "books" WHERE "books"."id" = 2 LIMIT 1
DELETE FROM "books" WHERE "books"."id" = 2
---
  def destroy
    @book = Book.find(params[:id])

    # update the running total.
    if @book.category.prefix_is_income?
      Book.delete_current_income(current_user.id, @book.amount)